specters312/SVD_DUMP/Atmel/ATSAM4LC2C.svd
        <register>
          <name>CSR</name>
          <description>Channel Status Register</description>
          <alternateGroup>LIN_MODE</alternateGroup>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXRDY</name>
              <description>Receiver Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RXRDYSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>At least one complete character has been received and RHR has not yet been read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXRDY</name>
              <description>Transmitter Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TXRDYSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>There is no character in the THR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXBRK</name>
              <description>Break Received/End of Break</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RXBRKSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No Break received or End of Break detected since the last RSTSTA</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Break Received or End of Break detected since the last RSTSTA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDRX</name>
              <description>End of Receiver Transfer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ENDRXSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The End of Transfer signal from the Receive PDC channel is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The End of Transfer signal from the Receive PDC channel is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDTX</name>
              <description>End of Transmitter Transfer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ENDTXSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The End of Transfer signal from the Transmit PDC channel is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The End of Transfer signal from the Transmit PDC channel is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRE</name>
              <description>Overrun Error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OVRESelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No overrun error has occurred since since the last RSTSTA</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>At least one overrun error has occurred since the last RSTSTA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAME</name>
              <description>Framing Error</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FRAMESelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No stop bit has been detected low since the last RSTSTA</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>At least one stop bit has been detected low since the last RSTSTA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARE</name>
              <description>Parity Error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PARESelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No parity error has been detected since the last RSTSTA</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>At least one parity error has been detected since the last RSTSTA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Receiver Time-out</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TIMEOUTSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>There has not been a time-out since the last Start Time-out command or the Time-out Register is 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>There has been a time-out since the last Start Time-out command</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmitter Empty</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TXEMPTYSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>There is at least one character in either THR or the Transmit Shift Register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITER</name>
              <description>Max number of Repetitions Reached</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ITERSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Maximum number of repetitions has not been reached since the last RSIT</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Maximum number of repetitions has been reached since the last RSIT</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXBUFE</name>
              <description>Transmission Buffer Empty</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TXBUFESelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The signal Buffer Empty from the Transmit PDC channel is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The signal Buffer Empty from the Transmit PDC channel is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXBUFF</name>
              <description>Reception Buffer Full</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RXBUFFSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The signal Buffer Full from the Receive PDC channel is inactive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The signal Buffer Full from the Receive PDC channel is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NACK</name>
              <description>Non Acknowledge or LIN Break Sent or LIN Break Received</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>NACKSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No Non Acknowledge has not been detected since the last RSTNACK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>At least one Non Acknowledge has been detected since the last RSTNACK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINID</name>
              <description>LIN Identifier Sent or LIN Identifier Received</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINTC</name>
              <description>LIN Transfer Conpleted</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RIIC</name>
              <description>Ring Indicator Input Change Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RIICSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No input change has been detected on the RI pin since the last read of CSR</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>At least one input change has been detected on the RI pin since the last read of CSR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSRIC</name>
              <description>Data Set Ready Input Change Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DSRICSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No input change has been detected on the DSR pin since the last read of CSR</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>At least one input change has been detected on the DSR pin since the last read of CSR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCDIC</name>
              <description>Data Carrier Detect Input Change Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DCDICSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No input change has been detected on the DCD pin since the last read of CSR</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>At least one input change has been detected on the DCD pin since the last read of CSR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTSIC</name>
              <description>Clear to Send Input Change Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CTSICSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No input change has been detected on the CTS pin since the last read of CSR</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>At least one input change has been detected on the CTS pin since the last read of CSR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RI</name>
              <description>Image of RI Input</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RISelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>RI is at 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>RI is at 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSR</name>
              <description>Image of DSR Input</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DSRSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>DSR is at 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DSR is at 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCD</name>
              <description>Image of DCD Input</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DCDSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>DCD is at 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DCD is at 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINBLS</name>
              <description>LIN Bus Line Status</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LINBLSSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>CTS is at 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>CTS is at 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINBE</name>
              <description>LIN Bit Error</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINISFE</name>
              <description>LIN Inconsistent Synch Field Error</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINIPE</name>
              <description>LIN Identifier Parity Error</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINCE</name>
              <description>LIN Checksum Error</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINSNRE</name>
              <description>LIN Slave Not Responding Error</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINSTE</name>
              <description>LIN Synch Tolerance Error</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LINSTESelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>COMM_TX is at 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>COMM_TX is at 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINHTE</name>
              <description>LIN Header Timeout Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LINHTESelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>COMM_RX is at 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>COMM_RX is at 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
